package U_6_Branches_Commits_GitHub_GitLab_BitBucket_Git;

public class GitHub {
    public static void main(String[] args) {
        System.out.println("GitHub — это хостинг: он позволяет хранить проекты удалённо на сервере и работать с ними из любой точки мира. Доступ к файлам есть у всех, у кого есть ссылка.\n" +
                "Одна из главных функций GitHub — контроль версий. Все изменения в коде можно отследить, поэтому в командной разработке это незаменимая вещь.\n" +
                "Кроме того, для начинающих разработчиков GitHub — это не только хостинг, но и способ собрать портфолио.");
        System.out.println("GitLab — это инструмент для хранения и управления репозиториями Git. Он дает возможность выполнять совместную разработку силами нескольких команд, применять обновления кода " +
                "и откатывать изменения, если это необходимо.");
        System.out.println("GitLab представляет собой веб-приложение и систему управления репозиториями программного кода для распределенной системы контроля версий Git. GitLab, как правило, используется с" +
                " Git, что позволяет разработчикам сохранять написанный код в онлайн-формате и работать с другими разработчиками над разными проектами.");
        System.out.println("https://github.com/gitIliyaM/gitMyGit");
        System.out.println("Остальные задания не стал делать выодится ошибка нет подключения, но локально сделал файл для" +
                "отправки на репозиторий, ошибка авторизации, не буду разбираться нет времени надо уже сдать проект" +
                "вернусь к этому потом");
    }
}
