package U_1_docker;

public class Docker {
    public static void main(String[] args) {
        System.out.println("Docker - инструменты и приложение контейнеризации, создания контейнеров, в которые помещаеются образы" +
                "приложения с возможностью запуска, остановки и удаления из контейнеров." +
                "Докер состоит из докет клиента - это консольный клиент, для взаимодействия с докер деймоном." +
                "Докер хостом - это ОС на нее устанавливают Докер. Докер деймон для управления контейнарми, образами, сетями," +
                "хранилищем-репозиторий." +
                "Аналоги имеются, но все пользуются Докером. Docker используют в сочетании с оркестраторами, такими как Kubernetes " +
                "и OpenShift");
    }
}
