package U_2_SQLite;

public class SQLiteMain {
    public static void main(String[] args) {
        System.out.println("SQLite — компактная встраиваемая реляционная база данных." +
                "SQLite не использует парадигму клиент-сервер. Т.е. движок SQLite не является отдельно работающим процессом, " +
                "с которым взаимодействует программа, а предоставляет библиотеку, с которой программа компонуется и движок становится " +
                "составной частью программы");
    }
}
